{
  "111111": {
    "name": "乾为天",
    "analysis": "象征阳刚至极、积极进取的能量。时运强盛，万事宜动不宜守。事业方面可放手一搏，有望出头。财运势头旺盛，容易获取升职加薪机会，投资有望收获回报。感情上阳气偏重，适宜主动告白或推动关系发展，但也需避免太过强势。"
  },
  "000000": {
    "name": "坤为地",
    "analysis": "象征包容、柔顺、厚德载物。万事以稳为主，适合延续、积累与守成。事业方面宜低调务实，不宜争功。财运稳定增长，适合长期理财或房地产等稳健项目。感情方面适合发展稳定的关系，婚恋运佳，能遇踏实可靠之人。"
  },
  "010001": {
    "name": "水雷屯",
    "analysis": "象征困难起步，如婴儿出生般艰难。事业方面可能遭遇初期不顺，但打好基础终有成。财运波动大，容易遇挫折，忌盲动。感情方面进展缓慢，可能存在误会和波折，重在信任与坚持。"
  },
  "100010": {
    "name": "山水蒙",
    "analysis": "象征启蒙与成长，需循序渐进加以引导。事业方面要接受学习、从基础做起，宜请教经验者。财运初期较弱，还需积累。感情上建议耐心了解彼此，避免一时冲动做决定。"
  },
  "010111": {
    "name": "水天需",
    "analysis": "象征等待时机、蓄势待发。运势未到爆发状态，仍需忍耐沉潜。事业应保持谨慎姿态，稳步推进。财运虽有门路，但时机未成熟，不适合大展拳脚。感情方面或有延迟、不明朗状态，保持耐心为佳。"
  },
  "111010": {
    "name": "天水讼",
    "analysis": "象征口舌争讼，应以理智和平处理矛盾。事业或人际关系中易生冲突，切忌争强好胜。财运起伏不定，可能涉及债务、官司等事宜。感情方面易有摩擦，建议各退一步。"
  },
  "000010": {
    "name": "地水师",
    "analysis": "象征组织与领导，如军队排列出征之象。适合团队合作或项目规划。事业方面需有纪律与策略，适合担任管理职务。财运方面会因团队或商业合作受益。感情方面情绪易紧张，建议互相理解、共同协作建立信任。"
  },
  "010000": {
    "name": "水地比",
    "analysis": "比为亲比、和谐相处之象，良好的人际运。事业上适合联手合作、组建团队。财运稳定，在合作或资源整合中有获利机会。感情上人缘佳，适合建立信任关系，发展友谊变爱情。"
  },
  "011111": {
    "name": "风天小畜",
    "analysis": "象征小有积蓄，宜收敛不宜扩张。事业中适合控制节奏，不可贪多求快。财运方面积少成多，适合理财管理、节流为主。感情发展稳中向好，但需要包容与耐心。"
  },
  "111011": {
    "name": "天泽履",
    "analysis": "象征小心谨慎，如履薄冰。做事需循规蹈矩、审慎前行。事业方面利于按章办事，保守中求突破。财运较稳，借助规则可以安全获利。感情方面注意界限与尊重，循序渐进更佳。"
  },
  "000111": {
    "name": "地天泰",
    "analysis": "象征天地交泰，阴阳和合，万事皆顺。事业发展顺畅，人际和谐。财运稳步上扬，正财为主。感情呈现甜蜜状态，适合结婚或确定关系。整体大吉之象，但仍需守常以保长远。"
  },
  "111000": {
    "name": "天地否",
    "analysis": "否为闭塞不通，对应运势下行。事业上沟通失效、人际不合，应当调整心态修正方向。财运紧张，进财困难，忌投资冒进。感情关系易陷冷淡期，应以沟通为桥梁。"
  },
  "111101": {
    "name": "天火同人",
    "analysis": "象征志同道合，合作为本之卦。事业适合团队合力解决难题，有共识者利成事。财运来自人脉或资源共享，合作共赢之相。感情方面适合“朋友升温”，彼此互通理念。"
  },
  "101111": {
    "name": "火天大有",
    "analysis": "象征富有、丰收、大成之象。事业上有机会展现才华，赢得掌声与收获。财运亨通，可通过智慧经营获得财富增长。感情中人缘佳、自信带来桃花，易得理想对象。"
  },
  "000100": {
    "name": "地山谦",
    "analysis": "谦者不争，自有天地。此卦主吉，越谦逊越有助力。事业上低调做人反得他人协助与提携。财运方面适合积累型操作，不宜张扬。感情方面性格谦和者易受青睐，感情和煦稳定。"
  },
  "001000": {
    "name": "雷地豫",
    "analysis": "象征喜悦、轻松、音乐与愉快的氛围。事业方面处于轻松稳定期，适合推进娱乐、艺术相关事业。财运平稳，有偏财运。感情氛围欢乐，宜增进感情交流，是约会、培养感情的好时机。"
  },
  "110001": {
    "name": "泽雷随",
    "analysis": "象征随顺、从众，顺势而为则吉。事业方面适合配合团队节奏，不宜逆势而上。财运方面顺应趋势可获利，适合跟随市场变化。感情方面顺其自然、放轻松，恋情反而水到渠成。"
  },
  "100110": {
    "name": "山风蛊",
    "analysis": "象征改革、整顿与清理。事业上容易遇到长期未解的问题，是时候彻底清理、调整结构。财运方面须警惕旧账、债务或资源流失。感情关系中若有误会或旧问题应主动修复，防止演变为长痛。"
  },
  "000110": {
    "name": "地泽临",
    "analysis": "象征临视、指导，有所掌控。事业运势强，适合领导、指导他人，执行管控计划。财运增长，有长辈或贵人帮助。感情方面会遇到成熟可靠的对象，能提供安全感。"
  },
  "011000": {
    "name": "风地观",
    "analysis": "象征观察、引导，细致入微。事业方面适合制定策略、做计划，需要耐心分析形势。财运尚可，精打细算可稳中求进。感情方面多以朋友转化为恋人，情感细水长流。"
  },
  "101001": {
    "name": "火雷噬嗑",
    "analysis": "象征困难与障碍，但经过克服之后必有收获。事业方面需先破后立，处理内部矛盾后方可畅通。财运方面短期内会有卡顿，处理妥当则转危为安。感情中如有冲突应冷静处理，方能更进一步。"
  },
  "100101": {
    "name": "山火贲",
    "analysis": "象征装饰、美化、外现和谐。事业适合设计、艺术等领域，也适合提升产品包装形象。财运方面宜通过形象、品位营销获得提升。感情关系注重仪式感，适合精心安排浪漫时光。"
  },
  "100000": {
    "name": "山地剥",
    "analysis": "象征剥落、退化，是警示卦。事业走下坡，需守心如一避祸根。财运逐渐减少，适合储蓄而非支出。感情方面关系缺少维系，需正视裂痕及时修补。"
  },
  "000001": {
    "name": "地雷复",
    "analysis": "象征回归、重启、复苏。适宜重新开始某个项目、关系或想法。事业方面经历低谷后将逐步回暖，是东山再起的好时机。财运恢复见涨，适合稳健试水。感情中可能出现旧情复燃，建议把握好节奏避免犯旧错。"
  },
  "111001": {
    "name": "天雷无妄",
    "analysis": "象征‘无妄之灾’，意外与反常之事频发。事业需坚守本分，投机取巧必招损失。财运易遇突发破耗，建议缩减开支。感情中误会增多，坦诚沟通可避嫌隙。"
  },
  "100111": {
    "name": "山天大畜",
    "analysis": "象征积蓄、内敛之象。要大有可为，需懂得等待时机。事业处于能量累积期，要沉住气。财运方面积少成多，适合储备、学习理财。感情方面宜慢热型发展，尊重彼此节奏。"
  },
  "100001": {
    "name": "山雷颐",
    "analysis": "象征养生、口腹、修养。事业提倡养精蓄锐、积蓄力量。适合休整或学习新技能。财运方面不宜大动，而应精细管理。感情中宜培养深层共鸣，重沟通与精神交流。"
  },
  "110011": {
    "name": "泽风大过",
    "analysis": "象征超越常理、负担过重，如栋梁弯曲需以柔克刚。事业方面责任过重或目标过高，需重新评估优先级。财运压力显著，避免借贷或高风险投入。感情关系可能因期望失衡而紧张，需调整相处模式。"
  },
  "010010": {
    "name": "坎为水",
    "analysis": "象征陷阱、艰难、守道。运势反复无常，需步步为营。事业磕磕碰碰，挑战多但可磨练意志。财运方面起伏不定，避免贪图偏门。感情方面易遇考验，诚信和坚守是关键。"
  },
  "101101": {
    "name": "离为火",
    "analysis": "象征光明、附丽、依托。事业方面光芒渐显，但注意情绪管理及合作关系维护。财运不错，可通过声望或形象获利。感情交流频繁，情感热烈，适合表达爱意，但需注意“容易点燃，也容易烧尽”。"
  },
  "110100": {
    "name": "泽山咸",
    "analysis": "象征感应、吸引力、相互靠近。事业方面适合结交新的伙伴，促进合作。财运通过人际关系增长，利于情感型消费领域。感情上容易一见钟情，情投意合，有快速发展可能。"
  },
  "001011": {
    "name": "雷风恒",
    "analysis": "象征恒久、稳定、持之以恒。事业方面贵在坚持，切忌三心二意，终可有成。财运积累稳定，适合长期理财项目。感情稳定发展，适宜经营婚姻或长久交往关系。"
  },
  "111100": {
    "name": "天山遁",
    "analysis": "象征退隐、避其锋芒。事业方面适合暂避冲突、后发制人，是战略性撤退的好时机。财运偏弱，应保守理财、减少投资。感情方面建议保持距离，冷静思考后续方向，避免陷入不健康关系。"
  },
  "001111": {
    "name": "雷天大壮",
    "analysis": "象征强健、行动力极强，得势易进。事业正值发力期，适合主动出击、争取突破。财运旺盛，适合涉足新项目，大胆但仍需理性决策。感情炽热，追求者多，需分清激情与真情。"
  },
  "101000": {
    "name": "火地晋",
    "analysis": "象征上升、前进、进阶之象。事业开始进入上升通道，可借东风扶摇直上。财运增长稳定，适合升职加薪或扩大利润空间。感情方面发展顺利，有望更进一步，宜乘势而上。"
  },
  "000101": {
    "name": "地火明夷",
    "analysis": "象征受伤之明，光明受损，宜隐忍。事业上容易被误解或打压，需低调行事，保存实力。财运不振，注意防盗防骗。感情方面信任受损或交流困难，需修复默契。"
  },
  "011101": {
    "name": "风火家人",
    "analysis": "象征家庭、责任与秩序，是内外平衡之卦。事业应从管理自身与家庭开始，内修则外安。财运尚可，家族运、房地产可带来收益。感情方面家庭幸福，人际和谐，适合婚恋发展。"
  },
  "101110": {
    "name": "火泽睽",
    "analysis": "象征分歧、相背之象。事业中容易立场冲突，不宜强行融合，建议寻找共识再前进。财运方面不稳定，投资合作应慎重。感情中情绪易失控，需沟通化解误会，理性主导较好。"
  },
  "001010": {
    "name": "水山蹇",
    "analysis": "象征艰难、险阻。事业方面困难重重，但勿轻言退缩，应坚韧等待转机。财运紧张，忌冒进求快。感情方面步履维艰，可能不被支持或误解较多，适合暂缓推进关系。"
  },
  "010100": {
    "name": "雷水解",
    "analysis": "象征化解、释放。适合打破僵局、解决冲突。事业方面瓶颈将被突破，可合作解决问题。财运逐渐回暖，有意外之喜。感情方面冷静沟通后可和解，适合和好与修复关系。"
  },
  "100011": {
    "name": "山泽损",
    "analysis": "象征减损自己、成全他人。事业方面如何“舍”决定能否“得”，适合舍短保长。财运尚可，谨慎支出，有利于慈善、教育投入。感情方面为对方付出将获更多回应，共建型关系顺利。"
  },
  "011001": {
    "name": "风雷益",
    "analysis": "象征增长、互利、利他得益。事业方面贵人运佳，适合共赢型项目。财运方面有增长之势，尤其利于咨询、培训、合作等相关行业。感情中彼此照应，容易收获满足与成长。"
  },
  "110111": {
    "name": "泽天夬",
    "analysis": "象征果决、断舍离。事业方面应果断抉择，不可拖泥带水。财运方面宜清理无效支出，选优投资。感情上需放下虚情假意，坚定真正选择。"
  },
  "111110": {
    "name": "天风姤",
    "analysis": "象征偶遇、机缘乍现，变化无常。事业中易遇机会，但稳定性待考。财运上可能有意外收获，但更需总结归纳、把握节奏。感情方面突如其来、风一般的情感，来得快亦去得快，贵在冷静。"
  },
  "110000": {
    "name": "泽地萃",
    "analysis": "象征聚集、汇合、人气旺盛。事业方面适合组织、举办会议或公众活动。财运以人脉广泛得利，合伙共建收益高。感情活跃、社交频繁，易遇有缘人。"
  },
  "000011": {
    "name": "地风升",
    "analysis": "象征由下而上的提升，小步快走稳进有喜。事业步步高升，适合提升自己实力、获取晋升。财运逐渐增长，贵在积累。感情方面双方关系升温，适合表白、订婚等仪式性推进。"
  },
  "110010": {
    "name": "泽水困",
    "analysis": "象征处境受限、困顿艰辛。事业方面处于困难期，建议调整预期、求援他助渡过难关。财运不济，切忌贪小失大。感情上相处不畅，建议真诚沟通，静心等待关系转机。"
  },
  "010011": {
    "name": "水风井",
    "analysis": "象征井然有序、持久发展。事业方面适合深耕、有条理地推进旧项目。财运稳中有升，不宜冒进，属于基础型理财之象。感情方面稳定、沉实，适合细水长流的感情经营。"
  },
  "110101": {
    "name": "泽火革",
    "analysis": "象征革新、变化、去旧迎新。事业方面进入转型期，不破不立，适合启动新项目。财运波动较大，但有望因调整而获利。感情关系中，适合主动解决旧矛盾，有望迎来新阶段。"
  },
  "101011": {
    "name": "火风鼎",
    "analysis": "象征鼎盛、价值实现之象，是变化后的稳定。事业方面处于上升阶段，特别适合创作、教育、文化类行业。财运不错，贵人提携下有收获。感情方面发展的和谐，适宜稳定关系或步入婚姻。"
  },
  "001001": {
    "name": "震为雷",
    "analysis": "象征行动、震动、觉醒。事业方面是启动突破的好时机，果断行动可逢凶化吉。财运方面多靠撞运气或来自突发机会。感情易起波澜，热情高涨但需顾及长远。"
  },
  "100100": {
    "name": "艮为山",
    "analysis": "象征止步、安守、内省。运势趋缓，应收敛锋芒、稳住局势。事业方面适合稳定发展，不宜频繁跳槽或变动。财运保守为宜，小财不断但不适合高风险操作。感情关系较慢热，需稳定经营。"
  },
  "011100": {
    "name": "风山渐",
    "analysis": "象征渐进、缓行、循序之道。事业方面虽无火箭式飞跃，但积累中成就稳固之基。财运渐增，适合长期投资项目。感情发展稳定，感情日益升温，适合与旧识发展恋情、成家立业。"
  },
  "001110": {
    "name": "雷泽归妹",
    "analysis": "象征婚嫁结合，但隐含变动与归宿。事业适合短期合作或跨界尝试，长期规划需谨慎。偏财运佳，但需防情感干扰决策。感情热烈却易变，理性选择方能长久。"
  },
  "001101": {
    "name": "雷火丰",
    "analysis": "象征光明、大成、盛极之象。运势处于巅峰状态。事业方面大有收获，适合展示才能与开展合作。财运极旺，但要注意守成。感情关系甜蜜热烈，适合约会旅行、谈婚论嫁，切勿骄傲自满。"
  },
  "101100": {
    "name": "火山旅",
    "analysis": "象征漂泊、历练、远行。事业方面适合外派、出差、跳槽或短期项目。财运偏流动性，适合兼职、副业或旅游类花费控制。感情方面易相识异地或异族之人，情感易聚易散，重在珍惜当下。"
  },
  "011011": {
    "name": "巽为风",
    "analysis": "象征渗透、灵动、柔中带刚。事业上适宜潜移默化地推行计划，适合销售、咨询、传播等行业。财运方面灵活应变者有利。感情方面情绪波动大，讲究沟通之道，感受型恋人最易相合。"
  },
  "110110": {
    "name": "兑为泽",
    "analysis": "象征喜悦、说服力强、亲和善交。事业上宜发挥社交能力和口才，适合市场、公关、主持等岗位。财运通过人脉而来，偏财有进。感情上人缘佳，有被追求可能，也应辨认真情假意。"
  },
  "011010": {
    "name": "风水涣",
    "analysis": "象征离散、化解、流动。事业方面适宜解决矛盾、打破僵局，可借外力突破。财运受流动性大影响，适合灵活机动型赚钱方式。感情方面可能出现暂时分离，冷静后或许更好。"
  },
  "010110": {
    "name": "水泽节",
    "analysis": "象征节制、有度，循规守序。事业发展中需学会管理时间与资源，方可稳中求进。财运节省得福，不宜铺张。感情发展不宜太快，保持距离感会更持久。"
  },
  "011110": {
    "name": "风泽中孚",
    "analysis": "象征诚信、信仰与忠实。事业方面重在真诚与守诺，得客户与上司信任者脱颖而出。财运来源于信誉、人情投资。感情方面关系建立在心灵契合上，是深入灵魂的交流。"
  },
  "001100": {
    "name": "雷山小过",
    "analysis": "象征小事可为，大事不宜。事业中适合专注于眼前的小目标，暂不适宜冒险决策。财运适合小单、小副业，小投入小回报最稳妥。感情上需细腻呵护，不适合突进式表白。"
  },
  "010101": {
    "name": "水火既济",
    "analysis": "象征事宜圆满、功成圆聚，但也暗含转折风险。事业方面收官得利，但应持续优化，防止松懈。财运丰厚，阶段性回报可观。感情关系融洽和谐，是“终成眷属”的象征，但要警惕新问题萌生。"
  },
  "101010": {
    "name": "火水未济",
    "analysis": "象征事未成、阴阳未交，需坚持到底。事业处于收尾关键期，细节疏漏恐致前功尽弃。财运回报延迟，耐心等待成果。感情关系未明，需时间验证真心。"
  }
}




